
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第一章.面向数据设计 · 面向数据设计</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="JiaDian Chen">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="Chapter1.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    简介
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="Chapter1.html">
            
                <a href="Chapter1.html">
            
                    
                    第一章.面向数据设计
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="Chapter1.html">
            
                <a href="Chapter1.html#一切皆关于数据">
            
                    
                    一切皆关于数据
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="Chapter1.html">
            
                <a href="Chapter1.html#数据不是问题域">
            
                    
                    数据不是问题域
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="Chapter1.html">
            
                <a href="Chapter1.html#数据与统计">
            
                    
                    数据与统计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.4" data-path="Chapter1.html">
            
                <a href="Chapter1.html#数据可以改变">
            
                    
                    数据可以改变
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.5" data-path="Chapter1.html">
            
                <a href="Chapter1.html#数据是怎么形成的？">
            
                    
                    数据是怎么形成的？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.6" data-path="Chapter1.html">
            
                <a href="Chapter1.html#框架">
            
                    
                    框架
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.7" data-path="Chapter1.html">
            
                <a href="Chapter1.html#结论与总结">
            
                    
                    结论与总结
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第一章.面向数据设计</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x4E00;&#x7AE0;&#x3001;&#x9762;&#x5411;&#x6570;&#x636E;&#x8BBE;&#x8BA1;">&#x7B2C;&#x4E00;&#x7AE0;&#x3001;&#x9762;&#x5411;&#x6570;&#x636E;&#x8BBE;&#x8BA1;</h1>
<p>&#x9762;&#x5411;&#x6570;&#x636E;&#x7684;&#x8BBE;&#x8BA1;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x6570;&#x5341;&#x79CD;&#x5F62;&#x5F0F;&#x5E76;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x4E86;&#x6570;&#x5341;&#x5E74;&#x4E4B;&#x4E45;&#x4E86;&#xFF0C;&#x4F46;&#x76F4;&#x5230;2009&#x5E74;9&#x6708;&#xFF0C;Noel Llopis&#x624D;&#x6B63;&#x5F0F;&#x7ED9;&#x5B83;&#x8D77;&#x4E86;&#x4E00;&#x4E2A;&#x4E0E;&#x4ED6;&#x7684;&#x8BBA;&#x6587;&#x6807;&#x9898;&#x76F8;&#x540C;&#x7684;&#x540D;&#x5B57;[&#xFF03;&#xFF01;NoelDOD&#xFF01;&#xFF03;]&#x3002;&#x5B83;&#x662F;&#x5426;&#x662F;&#x4E00;&#x79CD;&#x7F16;&#x7A0B;&#x8303;&#x4F8B;&#x662F;&#x6709;&#x4E89;&#x8BAE;&#x7684;&#x3002;&#x8BB8;&#x591A;&#x4EBA;&#x8BA4;&#x4E3A;&#x5B83;&#x53EF;&#x4EE5;&#x4E0E;&#x5176;&#x4ED6;&#x7F16;&#x7A0B;&#x8303;&#x4F8B;&#xFF08;&#x4F8B;&#x5982;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#xFF0C;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x6216;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#xFF09;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x3002;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x8BF4;&#x6CD5;&#x662F;&#x6B63;&#x786E;&#x7684;&#xFF0C;&#x9762;&#x5411;&#x6570;&#x636E;&#x7684;&#x8BBE;&#x8BA1;&#x53EF;&#x4EE5;&#x4E0E;&#x5176;&#x4ED6;&#x8303;&#x4F8B;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#xFF0C;&#x4F46;&#x8FD9;&#x5E76;&#x4E0D;&#x59A8;&#x788D;&#x5B83;&#x6210;&#x4E3A;&#x8FDB;&#x884C;&#x5927;&#x578B;&#x7F16;&#x7A0B;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x3002;&#x5176;&#x4ED6;&#x7F16;&#x7A0B;&#x8303;&#x4F8B;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x76F8;&#x4E92;&#x914D;&#x5408;&#x3002; Lisp&#x7A0B;&#x5E8F;&#x5458;&#x77E5;&#x9053;&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x53EF;&#x4EE5;&#x4E0E;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7F16;&#x7A0B;&#x5171;&#x5B58;&#xFF0C;&#x800C;C&#x7A0B;&#x5E8F;&#x5458;&#x5219;&#x6E05;&#x695A;&#x5730;&#x8BA4;&#x8BC6;&#x5230;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7F16;&#x7A0B;&#x53EF;&#x4EE5;&#x4E0E;&#x8FC7;&#x7A0B;&#x5F0F;&#x7F16;&#x7A0B;&#x5171;&#x5B58;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5FFD;&#x7565;&#x8FD9;&#x4E9B;&#x8BC4;&#x8BBA;&#xFF0C;&#x5E76;&#x5C06;&#x9762;&#x5411;&#x6570;&#x636E;&#x7684;&#x8BBE;&#x8BA1;&#x9610;&#x91CA;&#x4E3A;&#x53E6;&#x4E00;&#x79CD;&#x91CD;&#x8981;&#x5DE5;&#x5177;&#xFF0C;&#x4E0E;&#x5176;&#x4ED6;&#x5DE5;&#x5177;&#x5171;&#x5B58;&#x7684;&#x5DE5;&#x5177;&#x3002;</p>
<p>&#x65F6;&#x5149;&#x6B63;&#x503C;2009&#x5E74;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x786C;&#x4EF6;&#x5DF2;&#x7ECF;&#x6210;&#x719F;&#x5230;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x5F00;&#x53D1;&#x65B9;&#x5F0F;&#x7684;&#x6539;&#x53D8;&#x3002;&#x7136;&#x800C;&#x8FD0;&#x884C;&#x901F;&#x5EA6;&#x975E;&#x5E38;&#x5FEB;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x5374;&#x53D7;&#x5230;&#x4E86;&#x5FFD;&#x7565;&#x786C;&#x4EF6;&#x7684;&#x7F16;&#x7A0B;&#x8303;&#x4F8B;&#x7684;&#x963B;&#x788D;&#x3002;&#x5F53;&#x65F6;&#x6E38;&#x620F;&#x7A0B;&#x5E8F;&#x5458;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x65B9;&#x5F0F;&#x6298;&#x78E8;&#x7740;&#x8BB8;&#x591A;&#x5F15;&#x64CE;&#x7A0B;&#x5E8F;&#x5458;&#x3002;&#x65F6;&#x4EE3;&#x5728;&#x6539;&#x53D8;&#x3002;&#x73B0;&#x5728;&#x8BB8;&#x591A;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x548C;&#x684C;&#x9762;&#x8BBE;&#x5907;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4F3C;&#x4E4E;&#x90FD;&#x4E0D;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x9762;&#x5411;&#x6570;&#x636E;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x673A;&#x5668;&#x5DF2;&#x7ECF;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x7F13;&#x89E3;&#x8FD9;&#x79CD;&#x4F4E;&#x6548;&#x7387;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x662F;&#x8981;&#x56E0;&#x4E3A;&#x73B0;&#x5728;&#x7684;&#x6E38;&#x620F;&#x5BF9;&#x8BBE;&#x5907;&#x7684;&#x8981;&#x6C42;&#x4E0D;&#x9AD8;&#xFF0C;&#x590D;&#x6742;&#x6027;&#x4E5F;&#x8F83;&#x4F4E;&#x3002;&#x4F46;&#x662F;&#x79FB;&#x52A8;&#x6E38;&#x620F;&#x7684;&#x8D8B;&#x52BF;&#x4F3C;&#x4E4E;&#x6B63;&#x9010;&#x6E10;&#x5728;&#x8F6C;&#x5411;AAA&#x5F00;&#x53D1;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#x5E94;&#x8BE5;&#x4F1A;&#x5E26;&#x6765;&#x7BA1;&#x7406;&#x590D;&#x6742;&#x6570;&#x636E;&#x548C;&#x5145;&#x5206;&#x5229;&#x7528;&#x786C;&#x4EF6;&#x6027;&#x80FD;&#x7684;&#x9700;&#x6C42;&#x7684;&#x56DE;&#x5F52;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x751F;&#x6D3B;&#x5728;&#x4E00;&#x4E2A;&#x5145;&#x6EE1;&#x591A;&#x6838;&#x673A;&#x5668;&#xFF08;&#x5305;&#x62EC;&#x6211;&#x4EEC;&#x968F;&#x8EAB;&#x643A;&#x5E26;&#x7684;&#x8BBE;&#x5907;&#xFF09;&#x7684;&#x4E16;&#x754C;&#x4E2D;&#xFF0C;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x4EE5;&#x8F83;&#x5C11;&#x4E32;&#x884C;&#x65B9;&#x5F0F;&#x5F00;&#x53D1;&#x8F6F;&#x4EF6;&#x4FBF;&#x663E;&#x5F97;&#x91CD;&#x8981;&#x3002; &#x5BF9;&#x9762;&#x5411;&#x6570;&#x636E;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x79BB;&#x5F00;&#x5BF9;&#x8C61;&#x6D88;&#x606F;&#x4F20;&#x9012;&#x548C;&#x540C;&#x6B65;&#x5373;&#x65F6;&#x54CD;&#x5E94;&#x7684;&#x7F16;&#x7A0B;&#x65B9;&#x6CD5;&#x662F;&#x4E00;&#x79CD;&#x4FBF;&#x5229;&#x3002; &#x5B8C;&#x5168;&#x4F9D;&#x9760;&#x4E8E;&#x5BF9;&#x6570;&#x636E;&#x6D41;&#x7684;&#x4E86;&#x89E3;&#x7684;&#x7F16;&#x7A0B;&#x65B9;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x60A8;&#x8FC8;&#x5411;GPGPU&#xFF08;General-purpose computing on graphics processing units&#xFF0C;&#x901A;&#x7528;&#x56FE;&#x5F62;&#x5904;&#x7406;&#x5668;&#xFF09;&#x548C;&#x5176;&#x4ED6;&#x8BA1;&#x7B97;&#x65B9;&#x6CD5;&#x3002; &#x8FD9;&#x4F7F;&#x5F97;&#x5728;&#x5B9E;&#x73B0;&#x6211;&#x4EEC;&#x7684;&#x6E38;&#x620F;&#x65F6;&#x5FC5;&#x987B;&#x5904;&#x7406;&#x8FD9;&#x4E9B;&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#x3002; &#x9762;&#x5411;&#x6570;&#x636E;&#x8BBE;&#x8BA1;&#x7684;&#x9700;&#x6C42;&#x53EA;&#x4F1A;&#x7EE7;&#x7EED;&#x589E;&#x957F;&#xFF0C;&#x5B83;&#x5C06;&#x4E0D;&#x65AD;&#x589E;&#x957F;&#xFF0C;&#x56E0;&#x4E3A;&#x62BD;&#x8C61;&#x548C;&#x4E32;&#x884C;&#x601D;&#x8003;&#x65B9;&#x5F0F;&#x5C06;&#x5728;&#x6FC0;&#x70C8;&#x7684;&#x7ADE;&#x4E89;&#x4E2D;&#x6210;&#x4E3A;&#x74F6;&#x9888;&#xFF0C;&#x800C;&#x90A3;&#x4E9B;&#x62E5;&#x62B1;&#x9762;&#x5411;&#x6570;&#x636E;&#x7684;&#x65B9;&#x6CD5;&#x7684;&#x5219;&#x5C06;&#x84EC;&#x52C3;&#x53D1;&#x5C55;&#x3002;</p>
<h1 id="&#x4E00;&#x5207;&#x7686;&#x5173;&#x4E8E;&#x6570;&#x636E;">&#x4E00;&#x5207;&#x7686;&#x5173;&#x4E8E;&#x6570;&#x636E;</h1>
<p>&#x6570;&#x636E;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#xFF08;&#x5728;&#x6E38;&#x620F;&#x4E2D;&#xFF09;&#x6240;&#x62E5;&#x6709;&#x7684;&#x5168;&#x90E8;&#x3002;&#x6570;&#x636E;&#x662F;&#x6211;&#x4EEC;&#x6211;&#x4EEC;&#x5728;&#x521B;&#x9020;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x65F6;&#x6240;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#x7684;&#x5BF9;&#x8C61;&#xFF1B;&#x6570;&#x636E;&#x662F;&#x6211;&#x4EEC;&#x6253;&#x5F00;&#x6587;&#x6863;&#x65F6;&#x6240;&#x52A0;&#x8F7D;&#x7684;&#x5185;&#x5BB9;&#xFF1B;&#x6570;&#x636E;&#x662F;&#x5C4F;&#x5E55;&#x4E0A;&#x7684;&#x5448;&#x73B0;&#x7684;&#x56FE;&#x5F62;&#x3001;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x6E38;&#x620F;&#x624B;&#x67C4;&#x6309;&#x94AE;&#x70B9;&#x51FB;&#x4EA7;&#x751F;&#x7684;&#x8109;&#x51B2;&#x4FE1;&#x53F7;&#x3001;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x626C;&#x58F0;&#x5668;&#x80FD;&#x5728;&#x7A7A;&#x4E2D;&#x4EA7;&#x751F;&#x58F0;&#x6CE2;&#x7684;&#x539F;&#x56E0;&#x3001;&#x662F;&#x60A8;&#x5728;&#x6E38;&#x620F;&#x4E2D;&#x5347;&#x7EA7;&#x7684;&#x9014;&#x5F84;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x662F;&#x6E38;&#x620F;&#x4E2D;&#x53CD;&#x6D3E;&#x5982;&#x4F55;&#x611F;&#x77E5;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x4F4D;&#x7F6E;&#x5E76;&#x5411;&#x6211;&#x4EEC;&#x8FDB;&#x884C;&#x5C04;&#x51FB;&#x7684;&#x4F9D;&#x636E;&#x3002;&#x6570;&#x636E;&#x51B3;&#x5B9A;&#x4E86;&#x70B8;&#x836F;&#x7206;&#x70B8;&#x6240;&#x9700;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x4EE5;&#x53CA;&#x5F53;&#x6211;&#x4EEC;&#x7684;&#x89D2;&#x8272;&#x8DCC;&#x5728;&#x5C16;&#x523A;&#x4E0A;&#x65F6;&#x4F1A;&#x6389;&#x843D;&#x591A;&#x5C11;&#x679A;&#x91D1;&#x5E01;&#x3002;&#x4ECE;&#x5149;&#x76D8;&#x4E2D;&#x52A0;&#x8F7D;&#x540E;&#xFF0C;&#x7531;&#x6E90;&#x4EE3;&#x7801;&#x53CD;&#x9988;&#xFF0C;&#x5728;&#x7F16;&#x8BD1;&#x5668;&#x7F16;&#x8BD1;&#x800C;&#x6210;&#x7684;&#x7A0B;&#x5E8F;&#x96C6;&#x5411;&#x9A71;&#x52A8;&#x5668;&#x53D1;&#x5E03;&#x7684;&#x89E3;&#x7801;&#x6307;&#x4EE4;&#x7684;&#x8F6C;&#x6362;&#x4E0B;&#xFF0C;&#x6E38;&#x620F;&#x5F00;&#x59CB;&#x8FDB;&#x5165;&#x4E86;&#x60A8;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x800C;&#x5728;&#x5176;&#x7F8E;&#x4E3D;&#x7684;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x6570;&#x636E;&#x6B63;&#x51B3;&#x5B9A;&#x4E86;&#x6BCF;&#x4E00;&#x9897;&#x7C92;&#x5B50;&#x5F53;&#x524D;&#x7684;&#x4F4D;&#x7F6E;&#x548C;&#x901F;&#x5EA6;&#x3002;</p>
<p>&#x4EFB;&#x4F55;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4E86;&#x5B83;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5C06;&#x53D8;&#x5F97;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x662F;&#x3002;&#x6CA1;&#x6709;&#x56FE;&#x7247;&#x6570;&#x636E;&#x7684;Adobe Photoshop&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x662F;&#xFF0C;&#x6CA1;&#x6709;&#x7B14;&#x5237;&#x3001;&#x6CA1;&#x6709;&#x5C42;&#x3001;&#x6CA1;&#x6709;&#x7B14;&#x538B;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#xFF0C;&#x5B83;&#x4E5F;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x662F;&#x3002;Microsoft Word&#x6CA1;&#x6709;&#x4E86;&#x5B57;&#x7B26;&#x3001;&#x5B57;&#x4F53;&#x3001;&#x5206;&#x9875;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#xFF0C;&#x5B83;&#x5C06;&#x4EC0;&#x4E48;&#x4E5F;&#x4E0D;&#x662F;&#x3002;FL Studio&#x5931;&#x53BB;&#x4E86;&#x4E8B;&#x4EF6;&#x5C06;&#x53D8;&#x5F97;&#x4E00;&#x6587;&#x4E0D;&#x503C;&#x3002;Visual Studio&#x6CA1;&#x6709;&#x4E86;&#x6E90;&#x4EE3;&#x7801;&#x4E5F;&#x4F1A;&#x53D8;&#x5F97;&#x4E00;&#x65E0;&#x6240;&#x6709;&#x3002;&#x6240;&#x6709;&#x7F16;&#x5199;&#x5B8C;&#x6210;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x90FD;&#x662F;&#x88AB;&#x8BBE;&#x8BA1;&#x6210;&#x7528;&#x6765;&#x6839;&#x636E;&#x57FA;&#x4E8E;&#x8F93;&#x5165;&#x7684;&#x6570;&#x636E;&#x4EA7;&#x751F;&#x8F93;&#x51FA;&#x6570;&#x636E;&#x7684;&#x3002;&#x6570;&#x636E;&#x7684;&#x5F62;&#x5F0F;&#x53EF;&#x80FD;&#x975E;&#x5E38;&#x590D;&#x6742;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x7B80;&#x5355;&#x5230;&#x6839;&#x672C;&#x4E0D;&#x9700;&#x8981;&#x4EFB;&#x4F55;&#x6587;&#x6863;&#xFF0C;&#x4F46;&#x662F;&#x6240;&#x6709;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90FD;&#x4F1A;&#x4EA7;&#x751F;&#x548C;&#x4F9D;&#x8D56;&#x6570;&#x636E;&#x3002;&#x5982;&#x679C;&#x5B83;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x53EF;&#x8BC6;&#x522B;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x4EEC;&#x5145;&#x5176;&#x91CF;&#x662F;&#x73A9;&#x5177;&#x6216;&#x6F14;&#x793A;Demo&#x800C;&#x5DF2;&#x3002;        </p>
<p>&#x7A0B;&#x5E8F;&#x6307;&#x4EE4;&#xFF08;Instructions&#xFF09;&#x4E5F;&#x662F;&#x6570;&#x636E;&#x3002;&#x6307;&#x4EE4;&#x4F1A;&#x5360;&#x7528;&#x5185;&#x5B58;&#xFF0C;&#x5360;&#x7528;&#x5E26;&#x5BBD;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#xFF0C;&#x52A0;&#x8F7D;&#xFF0C;&#x4FDD;&#x5B58;&#x548C;&#x6784;&#x9020;&#x3002;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x81EA;&#x7136;&#x4E0D;&#x4F1A;&#x5C06;&#x6307;&#x4EE4;&#x89C6;&#x4E3A;&#x6570;&#x636E;&#x7684;1.2&#x7248;&#x672C;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x8F83;&#x65E7;&#x7684;&#xFF0C;&#x4FDD;&#x62A4;&#x6027;&#x8F83;&#x5DEE;&#x7684;&#x786C;&#x4EF6;&#x4E0A;&#x5B83;&#x4EEC;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x533A;&#x522B;&#x3002;&#x5373;&#x4F7F;&#x5728;&#x5927;&#x591A;&#x6570;&#x73B0;&#x4EE3;&#x786C;&#x4EF6;&#x4E0A;&#xFF0C;&#x4E3A;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;&#x9884;&#x7559;&#x7684;&#x5185;&#x5B58;&#x4F1A;&#x53D7;&#x5230;&#x4FDD;&#x62A4;&#xFF0C;&#x4EE5;&#x514D;&#x53D7;&#x7684;&#x635F;&#x5BB3;&#x548C;&#x4FEE;&#x6539;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x79CD;&#x76F8;&#x5BF9;&#x521B;&#x65B0;&#x4E5F;&#x4ECD;&#x7136;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x9879;&#x521B;&#x65B0;&#x800C;&#x5DF2;&#xFF0C;&#x5728;&#x6539;&#x8FDB;&#x7684;&#x54C8;&#x4F5B;&#x67B6;&#x6784;&#xFF08;&#x4E00;&#x79CD;CPU&#x67B6;&#x6784;&#xFF09;&#x4E2D;&#xFF0C;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x5185;&#x5B58;&#x548C;&#x5B58;&#x50A8;&#x6307;&#x4EE4;&#x65F6;&#x662F;&#x76F8;&#x540C;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6307;&#x4EE4;&#x4ECD;&#x7136;&#x662F;&#x4E00;&#x79CD;&#x6570;&#x636E;&#xFF0C;&#x5B83;&#x4EEC;&#x4E5F;&#x662F;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x6307;&#x4EE4;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x8F6C;&#x6362;&#x4E3A;&#x884C;&#x52A8;&#xFF08;Actions&#xFF09;&#x3002;&#x6307;&#x4EE4;&#x548C;&#x6570;&#x636E;&#x7684;&#x6570;&#x91CF;&#x3001;&#x5927;&#x5C0F;&#x548C;&#x9891;&#x7387;&#x8FD9;&#x4E9B;&#x56E0;&#x7D20;&#x90FD;&#x5F88;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x800C;&#x63A7;&#x5236;&#x7684;&#x7A0B;&#x5E8F;&#x6307;&#x4EE4;&#xFF0C;&#x4FC3;&#x4F7F;&#x6211;&#x4EEC;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#x3002;&#x6211;&#x4EEC;&#x5BF9;&#x6570;&#x636E;&#x662F;&#x4EC0;&#x4E48;&#x7684;&#x8BA4;&#x77E5;&#xFF0C;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x51B3;&#x5B9A;&#x5982;&#x4F55;&#x53BB;&#x5BF9;&#x5F85;&#x6570;&#x636E;&#x3002;&#x77E5;&#x9053;&#x4E86;&#x6307;&#x4EE4;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x5206;&#x8FA8;&#x54EA;&#x4E9B;&#x6307;&#x4EE4;&#x662F;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x54EA;&#x4E9B;&#x6307;&#x4EE4;&#x7684;&#x4EFB;&#x52A1;&#x6BD4;&#x8F83;&#x7E41;&#x91CD;&#x3001;&#x54EA;&#x4E9B;&#x6307;&#x4EE4;&#x6709;&#x7B49;&#x6548;&#x4F46;&#x662F;&#x66F4;&#x52A0;&#x9AD8;&#x6548;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<p>&#x8FD9;&#x6784;&#x6210;&#x4E86;&#x6211;&#x4EEC;&#x57FA;&#x4E8E;&#x9762;&#x5411;&#x6570;&#x636E;&#x7684;&#x5F00;&#x53D1;&#x65B9;&#x6CD5;&#x7684;&#x89C2;&#x70B9;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x4F46;&#x7701;&#x7565;&#x4E86;&#x4E00;&#x4E2A;&#x4E3B;&#x8981;&#x8981;&#x7D20;&#x3002;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x548C;&#x6570;&#x636E;&#x8F6C;&#x6362;&#xFF08;&#x4ECE;&#x5B57;&#x7B26;&#x4E32;&#x5230;&#x56FE;&#x50CF;&#xFF0C;&#x518D;&#x5230;&#x6307;&#x4EE4;&#xFF09;&#x90FD;&#x5FC5;&#x987B;&#x5728;&#x67D0;&#x79CD;&#x8BBE;&#x5907;&#x4E0A;&#x8FD0;&#x884C;&#x3002;&#x6709;&#x65F6;&#xFF0C;&#x8FD9;&#x4E2A;&#x6240;&#x8C13;&#x7684;&#x67D0;&#x79CD;&#x8BBE;&#x5907;&#x6709;&#x4E9B;&#x62BD;&#x8C61;&#xFF0C;&#x4F8B;&#x5982;&#x5B83;&#x53EF;&#x80FD;&#x662F;&#x5728;&#x672A;&#x77E5;&#x786C;&#x4EF6;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x865A;&#x62DF;&#x673A;&#x3002;&#x6709;&#x65F6;&#xFF0C;&#x5B83;&#x5219;&#x662F;&#x5177;&#x4F53;&#x7684;&#x8BBE;&#x5907;&#xFF0C;&#x4F8B;&#x5982;&#x6211;&#x4EEC;&#x80FD;&#x77E5;&#x6653;&#x60A8;&#x7684;&#x8BBE;&#x5907;&#x62E5;&#x6709;&#x54EA;&#x4E2A;&#x7279;&#x5B9A;&#x7684;CPU&#x548C;GPU&#xFF0C;&#x4EE5;&#x53CA;&#x62E5;&#x6709;&#x7684;&#x5185;&#x5B58;&#x5BB9;&#x91CF;&#x548C;&#x5E26;&#x5BBD;&#x3002;&#x4F46;&#x662F;&#x5728;&#x4EFB;&#x4F55;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6570;&#x636E;&#x4E0D;&#x4EC5;&#x662F;&#x6570;&#x636E;&#xFF0C;&#x5B83;&#x8FD8;&#x7279;&#x6307;&#x5B58;&#x5728;&#x4E8E;&#x67D0;&#x4E2A;&#x786C;&#x4EF6;&#x4E0A;&#x67D0;&#x4E2A;&#x4F4D;&#x7F6E;&#x5904;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x4E14;&#x5FC5;&#x987B;&#x7531;&#x540C;&#x4E00;&#x786C;&#x4EF6;&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#x3002;&#x672C;&#x8D28;&#x4E0A;&#xFF0C;&#x9762;&#x5411;&#x6570;&#x636E;&#x7684;&#x8BBE;&#x8BA1;&#x662F;&#x901A;&#x8FC7;&#x5F00;&#x53D1;&#x5BF9;&#x8F83;&#x597D;&#x7684;&#x7EC4;&#x7EC7;&#x5F62;&#x5F0F;&#x4E0B;&#x7684;&#x6570;&#x636E;&#x7684;&#x8F6C;&#x6362;&#x5F62;&#x5F0F;&#x6765;&#x8BBE;&#x8BA1;&#x8F6F;&#x4EF6;&#x7684;&#x5B9E;&#x8DF5;&#xFF0C;&#x5176;&#x4E2D;&#x8F83;&#x597D;&#x7684;&#x7EC4;&#x7EC7;&#x5F62;&#x5F0F;&#x7684;&#x6807;&#x51C6;&#x662F;&#x7531;&#x76EE;&#x6807;&#x786C;&#x4EF6;&#x4EE5;&#x53CA;&#x9700;&#x8981;&#x5728;&#x5176;&#x4E0A;&#x9762;&#x8FDB;&#x884C;&#x7684;&#x6570;&#x636E;&#x8F6C;&#x6362;&#x64CD;&#x4F5C;&#x7684;&#x6A21;&#x5F0F;&#x548C;&#x7C7B;&#x578B;&#x6765;&#x6307;&#x793A;&#x7684;&#x3002;&#x6709;&#x65F6;&#x5019;&#x6570;&#x636E;&#x6CA1;&#x6709;&#x88AB;&#x5F88;&#x597D;&#x5730;&#x8FDB;&#x884C;&#x5B9A;&#x4E49;&#xFF0C;&#x6709;&#x65F6;&#x786C;&#x4EF6;&#x6761;&#x4EF6;&#x4E5F;&#x662F;&#x6A21;&#x7CCA;&#x4E0D;&#x6E05;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5728;&#x5BF9;&#x786C;&#x4EF6;&#x80CC;&#x666F;&#x8FDB;&#x884C;&#x8F83;&#x597D;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x5230;&#x51E0;&#x4E4E;&#x6BCF;&#x4E2A;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x3002;    </p>
<p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6700;&#x7EC8;&#x7ED3;&#x679C;&#x662F;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x4E14;&#x6240;&#x6709;&#x8F93;&#x5165;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x6570;&#x636E;&#x8868;&#x793A;&#xFF0C;&#x5E76;&#x4E14;&#x8BA4;&#x8BC6;&#x5230;&#x6240;&#x6709;&#x6570;&#x636E;&#x8F6C;&#x6362;&#x90FD;&#x4E0D;&#x662F;&#x5728;&#x771F;&#x7A7A;&#xFF08;vacuum&#xFF09;&#x4E2D;&#x8FDB;&#x884C;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x57FA;&#x4E8E;&#x8FD9;&#x4E9B;&#x539F;&#x7406;&#x5EFA;&#x7ACB;&#x8D77;&#x4E00;&#x5957;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x65B9;&#x6CD5;&#x3002; &#x4E86;&#x89E3;&#x6570;&#x636E;&#x7684;&#x539F;&#x7406;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#xFF0C;&#x8FD9;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x5982;&#x4F55;&#x5904;&#x7406;&#x5177;&#x6709;&#x6B64;&#x6570;&#x91CF;&#xFF0C;&#x9891;&#x7387;&#x53CA;&#x5176;&#x7EDF;&#x8BA1;&#x8D28;&#x91CF;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x80FD;&#x505A;&#x4E9B;&#x4EC0;&#x4E48;&#x3002; &#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5EFA;&#x7ACB;&#x4E00;&#x5957;&#x6709;&#x5173;&#x4F7F;&#x65B9;&#x6CD5;&#x8BBA;&#x9762;&#x5411;&#x6570;&#x636E;&#x7684;&#x57FA;&#x7840;&#x58F0;&#x660E;&#x3002;&#x7406;&#x89E3;&#x6570;&#x636E;&#x53CA;&#x5176;&#x8F6C;&#x6362;&#x7684;&#x8FD9;&#x4E9B;&#x539F;&#x5219;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x7406;&#x89E3;&#x4E00;&#x53F0;&#x673A;&#x5668;&#x662F;&#x5982;&#x4F55;&#x5904;&#x7406;&#x8FD9;&#x4E2A;&#x6570;&#x91CF;&#x7EA7;&#x7684;&#x6570;&#x636E;&#x7684;&#x3002;&#x7ED9;&#x51FA;&#x8FD9;&#x4E9B;&#x57FA;&#x7840;&#x8BBA;&#x636E;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5EFA;&#x7ACB;&#x51FA;&#x4E00;&#x5957;&#x5173;&#x4E8E;&#x9762;&#x5411;&#x6570;&#x636E;&#x7684;&#x65B9;&#x6CD5;&#x8BBA;&#x7684;&#x57FA;&#x7840;&#x7406;&#x8BBA;&#x3002;</p>
<h1 id="&#x6570;&#x636E;&#x4E0D;&#x662F;&#x95EE;&#x9898;&#x57DF;">&#x6570;&#x636E;&#x4E0D;&#x662F;&#x95EE;&#x9898;&#x57DF;</h1>
<p>&#x7B2C;&#x4E00;&#x4E2A;&#x539F;&#x5219;&#xFF1A;&#x6570;&#x636E;&#x4E0D;&#x662F;&#x95EE;&#x9898;&#x57DF;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x9762;&#x5411;&#x6570;&#x636E;&#x7684;&#x8BBE;&#x8BA1;&#x4F3C;&#x4E4E;&#x662F;&#x5927;&#x591A;&#x6570;&#x5176;&#x4ED6;&#x7F16;&#x7A0B;&#x8303;&#x4F8B;&#x7684;&#x5BF9;&#x7ACB;&#x9762;&#xFF0C;&#x56E0;&#x4E3A;&#x9762;&#x5411;&#x6570;&#x636E;&#x7684;&#x8BBE;&#x8BA1;&#x662F;&#x4E0D;&#x4F1A;&#x8BA9;&#x95EE;&#x9898;&#x57DF;&#x6309;&#x6E90;&#x4EE3;&#x7801;&#x5F62;&#x5F0F;&#x8FDB;&#x5165;&#x8F6F;&#x4EF6;&#x4E00;&#x79CD;&#x6280;&#x672F;&#x3002;&#x5B83;&#x662F;&#x4E0D;&#x4F1A;&#x4EE5;&#x4EFB;&#x4F55;&#x65B9;&#x5F0F;&#x6765;&#x589E;&#x5F3A;&#x8BA4;&#x4E3A;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x662F;&#x4F5C;&#x4E3A;&#x5230;&#x7528;&#x6237;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x4E00;&#x79CD;&#x6620;&#x5C04;&#x7684;&#x8FD9;&#x79CD;&#x6982;&#x5FF5;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6570;&#x636E;&#x6709;&#x660E;&#x786E;&#x6027;&#x548C;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x4F46;&#x662F;&#x5374;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x73B0;&#x5B9E;&#x610F;&#x4E49;&#x3002;&#x91CD;&#x5EA6;&#x62BD;&#x8C61;&#x7684;&#x8303;&#x4F8B;&#x8BD5;&#x56FE;&#x5F53;&#x505A;&#x5728;&#x6BCF;&#x6B21;&#x8FD0;&#x884C;&#x4E2D;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x53CA;&#x5176;&#x6570;&#x636E;&#x90FD;&#x662F;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x4ECE;&#x800C;&#x9690;&#x85CF;&#x5B57;&#x8282;&#xFF0C;CPU&#x7BA1;&#x9053;&#x6216;&#x5176;&#x4ED6;&#x786C;&#x4EF6;&#x529F;&#x80FD;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x800C;&#x662F;&#x5C06;&#x95EE;&#x9898;&#x7684;&#x6A21;&#x578B;&#x5E26;&#x5165;&#x7A0B;&#x5E8F;&#x4E2D;&#x3002;&#x4ED6;&#x4EEC;&#x4E00;&#x822C;&#x5C06;&#x89C6;&#x56FE;&#x7684;&#x6A21;&#x578B;&#x5F15;&#x5165;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x6216;&#x8005;&#x5C06;&#x4E16;&#x754C;&#x7684;&#x6A21;&#x578B;&#x5F15;&#x5165;&#x95EE;&#x9898;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4ED6;&#x4EEC;&#x8981;&#x4E48;&#x56F4;&#x7ED5;&#x9884;&#x671F;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x5C5E;&#x6027;&#x6765;&#x6784;&#x9020;&#x4EE3;&#x7801;&#xFF0C;&#x8981;&#x4E48;&#x5C31;&#x56F4;&#x7ED5;&#x95EE;&#x9898;&#x57DF;&#x7684;&#x63CF;&#x8FF0;&#x6765;&#x6784;&#x9020;&#x4EE3;&#x7801;&#x3002;</p>
<h1 id="&#x6570;&#x636E;&#x4E0E;&#x7EDF;&#x8BA1;">&#x6570;&#x636E;&#x4E0E;&#x7EDF;&#x8BA1;</h1>
<p>&#x200B;        </p>
<h1 id="&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x6539;&#x53D8;">&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x6539;&#x53D8;</h1>
<h1 id="&#x6570;&#x636E;&#x662F;&#x600E;&#x4E48;&#x5F62;&#x6210;&#x7684;&#xFF1F;">&#x6570;&#x636E;&#x662F;&#x600E;&#x4E48;&#x5F62;&#x6210;&#x7684;&#xFF1F;</h1>
<h1 id="&#x6846;&#x67B6;">&#x6846;&#x67B6;</h1>
<h1 id="&#x7ED3;&#x8BBA;&#x4E0E;&#x603B;&#x7ED3;">&#x7ED3;&#x8BBA;&#x4E0E;&#x603B;&#x7ED3;</h1>

                                
                                </section>
                            
                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 简介">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="Chapter1.html#一切皆关于数据" class="navigation navigation-next " aria-label="Next page: 一切皆关于数据">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第一章.面向数据设计","level":"1.2","depth":1,"next":{"title":"一切皆关于数据","level":"1.2.1","depth":2,"anchor":"#一切皆关于数据","path":"Chapter1.md","ref":"Chapter1.md#一切皆关于数据","articles":[]},"previous":{"title":"简介","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-sharing","-highlight","-search","-livereload","-font-settings"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"github":{"url":"https://github.com/Gaddient"},"anchor-navigation-ex":{"showLevel":false},"favicon":{"shortcut":"./source/images/favicon.jpg","bookmark":"./source/images/favicon.jpg","appleTouch":"./source/images/apple-touch-icon-precomposed-152.jpg","appleTouchMore":{"120x120":"./source/images/apple-touch-icon-precomposed-152.jpg","180x180":"./source/images/apple-touch-icon-precomposed-152.jpg"}},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"JiaDian Chen","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"面向数据设计","language":"zh-hans","gitbook":"3.2.3","description":"Data-Oriented Design中文翻译"},"file":{"path":"Chapter1.md","mtime":"2020-08-02T15:05:35.319Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-08-02T15:07:23.155Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

